#Не совсем корректное задание т.к. по условию задачи, если в сумме более 10к, но если Андрей покупает в разных магазинах, то необходимо рассматривать не общую стоимость чека, а по отдельности в каждом магазине😀

first = int(input("Введите цену за первый стул: "))
second = int(input("Введите цену за второй стул: "))
third = int(input("Введите цену за третий стул: "))

amount = first + second + third
print(f"Цена без скидки: {amount}")
if amount > 10000:
  discounted_amount = amount * 0.9
  print(f"Цена со скидкой: {discounted_amount}")
  